{"name":"uci_adult","title":"Adult","description":"Predict whether income exceeds $50K/yr based on census data.  Also known as \"Census Income\" dataset.\n\n# Source:\nDonor: \nRonny Kohavi and Barry BeckerData Mining and VisualizationSilicon Graphics.e-mail: ronnyk '@' live.com for questions.\n# Data Set Information:\nExtraction was done by Barry Becker from the 1994 Census database. A set of reasonably clean records was extracted using the following conditions: ((AAGE>16) && (AGI>100) && (AFNLWGT>1)&& (HRSWK>0))\nPrediction task is to determine whether a person makes over 50K a year.\n# Attribute Information:\nListing of attributes:\n>50K, <=50K.\nage: continuous.workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.fnlwgt: continuous.education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.education-num: continuous.marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.sex: Female, Male.capital-gain: continuous.capital-loss: continuous.hours-per-week: continuous.native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.\n# Relevant Papers:\nRon Kohavi, \"Scaling Up the Accuracy of Naive-Bayes Classifiers: a Decision-Tree Hybrid\", Proceedings of the Second International Conference on Knowledge Discovery and Data Mining, 1996 \n# Papers That Cite This Data Set1:\nRakesh Agrawal and Ramakrishnan ikant and Dilys Thomas. Privacy Preserving OLAP. SIGMOD Conference. 2005.\n * Rich Caruana and Alexandru Niculescu-Mizil. An Empirical Evaluation of Supervised Learning for ROC Area. ROCAI. 2004.\n * Rich Caruana and Alexandru Niculescu-Mizil and Geoff Crew and Alex Ksikes. Ensemble selection from libraries of models. ICML. 2004.\n * Bianca Zadrozny. Learning and evaluating classifiers under sample selection bias. ICML. 2004.\n * Wei-Chun Kao and Kai-Min Chung and Lucas Assun and Chih-Jen Lin. Decomposition Methods for Linear Support Vector Machines. Neural Computation, 16. 2004.\n * Saharon Rosset. Model selection via the AUC. ICML. 2004.\n * Christopher R. Palmer and Christos Faloutsos. Electricity Based External Similarity of Categorical Attributes. PAKDD. 2003.\n * S. Sathiya Keerthi and Chih-Jen Lin. Asymptotic Behaviors of Support Vector Machines with Gaussian Kernel. Neural Computation, 15. 2003.\n * Thomas Serafini and G. Zanghirati and Del Zanna and T. Serafini and Gaetano Zanghirati and Luca Zanni. DIPARTIMENTO DI MATEMATICA. Gradient Projection Methods for. 2003.\n * Bart Hamers and J. A. K Suykens. Coupled Transductive Ensemble Learning of Kernel Models. Bart De Moor. 2003.\n * Andrew W. Moore and Weng-Keen Wong. Optimal Reinsertion: A New Search Operator for Accelerated and More Accurate Bayesian Network Structure Learning. ICML. 2003.\n * Alexander J. Smola and Vishy Vishwanathan and Eleazar Eskin. Laplace Propagation. NIPS. 2003.\n * I. Yoncaci. Maximum a Posteriori Tree Augmented Naive Bayes Classifiers. O EN INTEL.LIG ` ENCIA ARTIFICIAL CSIC. 2003.\n * Nitesh V. Chawla and Kevin W. Bowyer and Lawrence O. Hall and W. Philip Kegelmeyer. SMOTE: Synthetic Minority Over-sampling Technique. J. Artif. Intell. Res. (JAIR, 16. 2002.\n * S. Sathiya Keerthi and Kaibo Duan and Shirish Krishnaj Shevade and Aun Neow Poo. A Fast Dual Algorithm for Kernel Logistic Regression. ICML. 2002.\n * Ramesh Natarajan and Edwin P D Pednault. Segmented Regression Estimators for Massive Data Sets. SDM. 2002.\n * Bianca Zadrozny and Charles Elkan. Transforming classifier scores into accurate multiclass probability estimates. KDD. 2002.\n * Zhiyuan Chen and Johannes Gehrke and Flip Korn. Query Optimization In Compressed Database Systems. SIGMOD Conference. 2001.\n * Stephen D. Bay. Multivariate Discretization for Set Mining. Knowl. Inf. Syst, 3. 2001.\n * Bernhard Pfahringer and Geoffrey Holmes and Richard Kirkby. Optimizing the Induction of Alternating Decision Trees. PAKDD. 2001.\n * Stephen D. Bay and Michael J. Pazzani. Detecting Group Differences: Mining Contrast Sets. Data Min. Knowl. Discov, 5. 2001.\n * Jie Cheng and Russell Greiner. Learning Bayesian Belief Network Classifiers: Algorithms and System. Canadian Conference on AI. 2001.\n * Dmitry Pavlov and Jianchang Mao and Byron Dom. Scaling-Up Support Vector Machines Using Boosting Algorithm. ICPR. 2000.\n * Gary M. Weiss and Haym Hirsh. A Quantitative Study of Small Disjuncts: Experiments and Results. Department of Computer Science Rutgers University. 2000.\n * Dmitry Pavlov and Darya Chudova and Padhraic Smyth. Towards scalable support vector machines using squashing. KDD. 2000.\n * Kristin P. Bennett and Ayhan Demiriz and John Shawe-Taylor. A Column Generation Algorithm For Boosting. ICML. 2000.\n * Petri Kontkanen and Jussi Lahtinen and Petri Myllymaki and Tomi Silander and Henry Tirri. Proceedings of Pre- and Post-processing in Machine Learning and Data Mining: Theoretical Aspects and Applications, a workshop within Machine Learning and Applications. Complex Systems Computation Group (CoSCo). 1999.\n * Jie Cheng and Russell Greiner. Comparing Bayesian Network Classifiers. UAI. 1999.\n * Yk Huhtala and Juha Kärkkäinen and Pasi Porkka and Hannu Toivonen. Efficient Discovery of Functional and Approximate Dependencies Using Partitions. ICDE. 1998.\n * John C. Platt. Using Analytic QP and Sparseness to Speed Training of Support Vector Machines. NIPS. 1998.\n * Ron Kohavi. Scaling Up the Accuracy of Naive-Bayes Classifiers: A Decision-Tree Hybrid. KDD. 1996.\n * Grigorios Tsoumakas and Ioannis P. Vlahavas. Fuzzy Meta-Learning: Preliminary Results. Greek Secretariat for Research and Technology.\n * Josep Roure Alcobe. Incremental Hill-Climbing Search Applied to Bayesian Network Structure Learning. Escola Universitria Politcnica de Mataro.\n * Ayhan Demiriz and Kristin P. Bennett and John Shawe and I. Nouretdinov V.. Linear Programming Boosting via Column Generation. Dept. of Decision Sciences and Eng. Systems, Rensselaer Polytechnic Institute.\n * Chris Giannella and Bassem Sayrafi. An Information Theoretic Histogram for Single Dimensional Selectivity Estimation. Department of Computer Science, Indiana University Bloomington.\n * Rong-En Fan and P. -H Chen and C. -J Lin. Working Set Selection Using the Second Order Information for Training SVM. Department of Computer Science and Information Engineering National Taiwan University.\n * Petri Kontkanen and Jussi Lahtinen and Petri Myllymaki and Tomi Silander and Henry Tirri. USING BAYESIAN NETWORKS FOR VISUALIZING HIGH-DIMENSIONAL DATA. Complex Systems Computation Group (CoSCo).\n * Ahmed Hussain Khan and Intensive Care. Multiplier-Free Feedforward Networks. 174.\n * Luc Hoegaerts and J. A. K Suykens and J. Vandewalle and Bart De Moor. Subset Based Least Squares Subspace Regression in RKHS. Katholieke Universiteit Leuven Department of Electrical Engineering, ESAT-SCD-SISTA.\n * David R. Musicant and Alexander Feinberg. Active Set Support Vector Regression.\n * Luc Hoegaerts and J. A. K Suykens and J. Vandewalle and Bart De Moor. Primal Space Sparse Kernel Partial Least Squares Regression for Large Scale Problems Special Session paper . Katholieke Universiteit Leuven Department of Electrical Engineering, ESAT-SCD-SISTA.\n * Kuan-ming Lin and Chih-Jen Lin. A Study on Reduced Support Vector Machines. Department of Computer Science and Information Engineering National Taiwan University.\n * Luca Zanni. An Improved Gradient Projection-based Decomposition Technique for Support Vector Machines. Dipartimento di Matematica, Universitdi Modena e Reggio Emilia.\n * Jeff G. Schneider and Andrew W. Moore. Active Learning in Discrete Input Spaces. School of Computer Science Carnegie Mellon University.\n * Omid Madani and David M. Pennock and Gary William Flake. Co-Validation: Using Model Disagreement to Validate Classification Algorithms. Yahoo! Research Labs.\n * Ron Kohavi and Barry G. Becker and Dan Sommerfield. Improving Simple Bayes. Data Mining and Visualization Group Silicon Graphics, Inc.\n * Shi Zhong and Weiyu Tang and Taghi M. Khoshgoftaar. Boosted Noise Filters for Identifying Mislabeled Data. Department of Computer Science and Engineering Florida Atlantic University.\n * David R. Musicant. DATA MINING VIA MATHEMATICAL PROGRAMMING AND MACHINE LEARNING. Doctor of Philosophy (Computer Sciences) UNIVERSITY.\n * William W. Cohen and Yoram Singer. A Simple, Fast, and Effective Rule Learner. AT&T Labs*Research Shannon Laboratory.\n * Haixun Wang and Philip S. Yu. SSDT-NN: A Subspace-Splitting Decision Tree Classifier with Application to Target Selection. IBM T. J. Watson Research Center.\n * S. V. N Vishwanathan and Alexander J. Smola and M. Narasimha Murty. considerably faster than competing methods such as Sequential Minimal Optimization or the Nearest Point Algorithm. Machine Learning Program, National ICT for Australia.\n# Citation Request:\nPlease refer to the Machine Learning [Repository's citation policy.](http://archive.ics.uci.edu/ml/citation_policy.html)\n[1] Papers were automatically harvested and associated with this data set, in collaborationwith [Rexa.info](http://rexa.info/)","homepage":"https://data.world/uci/adult","license":"Other","resources":[{"name":"adult_data","schema":{"fields":[{"name":"39","title":"39","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"39"},{"name":"state_gov","title":"State-gov","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"state_gov"},{"name":"77516","title":"77516","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"77516"},{"name":"bachelors","title":"Bachelors","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"bachelors"},{"name":"13","title":"13","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"13"},{"name":"never_married","title":"Never-married","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"never_married"},{"name":"adm_clerical","title":"Adm-clerical","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"adm_clerical"},{"name":"not_in_family","title":"Not-in-family","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"not_in_family"},{"name":"white","title":"White","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"white"},{"name":"male","title":"Male","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"male"},{"name":"2174","title":"2174","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"2174"},{"name":"0","title":"0","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"0"},{"name":"40","title":"40","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"40"},{"name":"united_states","title":"United-States","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"united_states"},{"name":"50k","title":"<=50K","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"50k"}]},"path":"data/adult_data.csv","format":"csv"},{"name":"adult_test","schema":{"fields":[{"name":"25","title":"25","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"25"},{"name":"private","title":"Private","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"private"},{"name":"226802","title":"226802","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"226802"},{"name":"11th","title":"11th","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"11th"},{"name":"7","title":"7","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"7"},{"name":"never_married","title":"Never-married","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"never_married"},{"name":"machine_op_inspct","title":"Machine-op-inspct","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"machine_op_inspct"},{"name":"own_child","title":"Own-child","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"own_child"},{"name":"black","title":"Black","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"black"},{"name":"male","title":"Male","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"male"},{"name":"0","title":"0","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"0"},{"name":"0_2","title":"0","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"0_2"},{"name":"40","title":"40","type":"integer","rdfType":"http://www.w3.org/2001/XMLSchema#integer","dwSourceId":"40"},{"name":"united_states","title":"United-States","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"united_states"},{"name":"50k","title":"<=50K.","type":"string","rdfType":"http://www.w3.org/2001/XMLSchema#string","dwSourceId":"50k"}]},"path":"data/adult_test.csv","format":"csv"},{"name":"original/Index.txt","path":"original/Index.txt","format":"txt","mediatype":"text/plain","bytes":140},{"name":"original/adult.data.csv","path":"original/adult.data.csv","format":"csv","mediatype":"text/csv","bytes":3974305},{"name":"original/adult.names.txt","path":"original/adult.names.txt","format":"txt","mediatype":"text/plain","bytes":5229},{"name":"original/adult.test.csv","path":"original/adult.test.csv","format":"csv","mediatype":"text/csv","bytes":2003153},{"name":"original/old.adult.names.txt","path":"original/old.adult.names.txt","format":"txt","mediatype":"text/plain","bytes":4267}],"keywords":["uci","social","categorical","integer","classification"]}